
## Plan Result

[CI link](https://github.com/shotaIDE/my-pet-melody/actions/runs/10751714581)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 4 to change, 1 to destroy.</code></pre>

* Update
  * google_cloudfunctions_function.detect
  * google_cloudfunctions_function.piece
  * google_cloudfunctions_function.submit
  * google_project.default
* Replace
  * google_storage_bucket_object.functions_src


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_cloudfunctions_function.detect will be updated in-place
  ~ resource "google_cloudfunctions_function" "detect" {
        id                            = "colomney-my-pet-melody/asia-east1/detect"
        name                          = "detect"
      ~ source_archive_object         = "functions/src_b6541e5794de3f82750281cc833b6695.zip" -> "functions/src_5c2420991ff540723cc350051258b37d.zip"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_cloudfunctions_function.piece will be updated in-place
  ~ resource "google_cloudfunctions_function" "piece" {
        id                            = "colomney-my-pet-melody/asia-east1/piece"
        name                          = "piece"
      ~ source_archive_object         = "functions/src_b6541e5794de3f82750281cc833b6695.zip" -> "functions/src_5c2420991ff540723cc350051258b37d.zip"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_cloudfunctions_function.submit will be updated in-place
  ~ resource "google_cloudfunctions_function" "submit" {
        id                            = "colomney-my-pet-melody/asia-east1/submit"
        name                          = "submit"
      ~ source_archive_object         = "functions/src_b6541e5794de3f82750281cc833b6695.zip" -> "functions/src_5c2420991ff540723cc350051258b37d.zip"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_project.default will be updated in-place
  ~ resource "google_project" "default" {
      ~ deletion_policy     = "DELETE" -> "PREVENT"
        id                  = "projects/colomney-my-pet-melody"
        name                = "MyPetMelody"
        # (7 unchanged attributes hidden)
    }

  # google_storage_bucket_object.functions_src must be replaced
-/+ resource "google_storage_bucket_object" "functions_src" {
      + content             = (sensitive value)
      ~ content_type        = "application/zip" -> (known after apply)
      ~ crc32c              = "wSH7zQ==" -> (known after apply)
      ~ detect_md5hash      = "tlQeV5TeP4J1AoHMgztmlQ==" -> "different hash" # forces replacement
      - event_based_hold    = false -> null
      ~ id                  = "colomney-my-pet-melody-deploy-functions/src_b6541e5794de3f82750281cc833b6695.zip" -> (known after apply)
      + kms_key_name        = (known after apply)
      ~ md5hash             = "tlQeV5TeP4J1AoHMgztmlQ==" -> (known after apply)
      ~ media_link          = "https://storage.googleapis.com/download/storage/v1/b/colomney-my-pet-melody-deploy/o/functions%2Fsrc_b6541e5794de3f82750281cc833b6695.zip?generation=1725318658125114&alt=media" -> (known after apply)
      - metadata            = {} -> null
      ~ name                = "functions/src_b6541e5794de3f82750281cc833b6695.zip" -> "functions/src_5c2420991ff540723cc350051258b37d.zip" # forces replacement
      ~ output_name         = "functions/src_b6541e5794de3f82750281cc833b6695.zip" -> (known after apply)
      ~ self_link           = "https://www.googleapis.com/storage/v1/b/colomney-my-pet-melody-deploy/o/functions%2Fsrc_b6541e5794de3f82750281cc833b6695.zip" -> (known after apply)
      ~ storage_class       = "STANDARD" -> (known after apply)
      - temporary_hold      = false -> null
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 4 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"check-plan","PRNumber":1297,"Program":"tfcmt","SHA1":"e313b30b73ebe54869fd59fbdff4377fcffd520d","Vars":{},"WorkflowName":"CI / Infrastructure Production"} -->